In [95]:
import pandas as pd

df = pd.read_csv("sample_people.csv")
# df.fillna(0)
# df.dropna(inplace=False)
# df.dropna(axis=1)
# df.dropna(how="all")
# df.drop_duplicates()
df.duplicated()
df.dtypes

Name          object
Age            int64
Email         object
Occupation    object
dtype: object

In [23]:
df.head()

          Name  Age                  Email         Occupation
0  Alice Smith   28  alice.smith@email.com     Data Scientist
1  Bob Johnson   34  bob.johnson@email.com  Software Engineer
2    Carol Lee   25    carol.lee@email.com    Product Manager
3    David Kim   42    david.kim@email.com           Designer
4   Eve Turner   30   eve.turner@email.com      Data Analyst

In [24]:
df.columns

Index(['Name', 'Age', 'Email', 'Occupation'], dtype='object')

In [25]:
df.shape

(5, 4)

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   Email       6 non-null      object
 3   Occupation  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 324.0+ bytes

In [27]:
df.describe()

             Age
count   5.000000
mean   31.800000
std     6.572671
min    25.000000
25%    28.000000
50%    30.000000
75%    34.000000
max    42.000000

In [28]:
scores = [88, 92, 79, 93]

s = pd.Series(scores)
print(s)

0    88
1    92
2    79
3    93
dtype: int64

In [30]:
names = ["Alice", "Bob", "Charlie", "David"]

s2 = pd.Series(scores, index=names)
print(s2)

Alice      88
Bob        92
Charlie    79
David      93
dtype: int64

In [44]:
print(df.Name)
print(30 * "=")
print(df.Name, df.Age)

0    Alice Smith
1    Bob Johnson
2      Carol Lee
3      David Kim
4     Eve Turner
Name: Name, dtype: object
==============================
0    Alice Smith
1    Bob Johnson
2      Carol Lee
3      David Kim
4     Eve Turner
Name: Name, dtype: object 0    28
1    34
2    25
3    42
4    30
Name: Age, dtype: int64

In [9]:
df.loc[1]

Name                    Bob Johnson
Age                              34
Email         bob.johnson@email.com
Occupation        Software Engineer
Name: 1, dtype: object

In [16]:
print(df.iloc[1, 0])
print(df.iloc[1, 1])

Bob Johnson
34

In [ ]:
df.loc[0:2]

          Name  Age                  Email         Occupation
0  Alice Smith   28  alice.smith@email.com     Data Scientist
1  Bob Johnson   34  bob.johnson@email.com  Software Engineer
2    Carol Lee   25    carol.lee@email.com    Product Manager

In [23]:
df["Employed"] = True
df

          Name  Age                  Email         Occupation  Employed
0  Alice Smith   28  alice.smith@email.com     Data Scientist      True
1  Bob Johnson   34  bob.johnson@email.com  Software Engineer      True
2    Carol Lee   25    carol.lee@email.com    Product Manager      True
3    David Kim   42    david.kim@email.com           Designer      True
4   Eve Turner   30   eve.turner@email.com      Data Analyst       True

In [35]:
df["Age in 5 Years"] = df["Age"] + 5
df

,Full Name,Age,Email,Occupation,Employed,Age in 5 Years
0,Alice Smith,28,alice.smith@email.com,Data Scientist,True,33
1,Bob Johnson,34,bob.johnson@email.com,Software Engineer,True,39
2,Carol Lee,25,carol.lee@email.com,Product Manager,True,30
3,David Kim,42,david.kim@email.com,Designer,True,47
4,Eve Turner,30,eve.turner@email.com,Data Analyst,True,35

In [37]:
df.rename(columns={"Name": "Full Name"}, inplace=True)
df

,Full Name,Age,Email,Occupation,Employed,Age in 5 Years
0,Alice Smith,28,alice.smith@email.com,Data Scientist,True,33
1,Bob Johnson,34,bob.johnson@email.com,Software Engineer,True,39
2,Carol Lee,25,carol.lee@email.com,Product Manager,True,30
3,David Kim,42,david.kim@email.com,Designer,True,47
4,Eve Turner,30,eve.turner@email.com,Data Analyst,True,35

In [ ]:
df.drop("Employed", axis=1)

     Full Name  Age                  Email         Occupation  Age in 5 Years
0  Alice Smith   28  alice.smith@email.com     Data Scientist              33
1  Bob Johnson   34  bob.johnson@email.com  Software Engineer              39
2    Carol Lee   25    carol.lee@email.com    Product Manager              30
3    David Kim   42    david.kim@email.com           Designer              47
4   Eve Turner   30   eve.turner@email.com      Data Analyst               35

In [59]:
# df.set_index("Full Name", inplace=False)
df.reset_index(drop=False)

,Full Name,Age,Email,Occupation,Employed,Age in 5 Years
0,Alice Smith,28,alice.smith@email.com,Data Scientist,True,33
1,Bob Johnson,34,bob.johnson@email.com,Software Engineer,True,39
2,Carol Lee,25,carol.lee@email.com,Product Manager,True,30
3,David Kim,42,david.kim@email.com,Designer,True,47
4,Eve Turner,30,eve.turner@email.com,Data Analyst,True,35

In [80]:
df.isna().sum()

Name          0
Age           0
Email         0
Occupation    1
dtype: int64